% 2つの数値ベクトルが与えられる
% 相関係数を返す

% --------------------------------------
% 入力部分
% 1-77までのランダムな数を持つ数ベクトル(777個の要素を持つ)を生成
A = rand(1, 777) * randi([2,77]);
B = rand(1, 777) * randi([2,77]);
% --------------------------------------

% --------------------------------------
% 処理部分

Ans = (vec - mean(vec)) ./ (std(vec));
disp('解答');
disp('平均が0、標準偏差が1になれば正しい');
disp('平均');
disp(mean(Ans));
disp('標準偏差');
disp(std(Ans));
% --------------------------------------

% --------------------------------------
% 検算用
disp('検算用');
disp('平均');
disp(mean(zscore(vec)));
disp('標準偏差');
disp(std(zscore(vec)));
% --------------------------------------