% 2つの数値ベクトルが与えられる
% 回帰係数を返す

format long

% --------------------------------------
% 入力部分
% 1-77までのランダムな数を持つ数ベクトル(7777個の要素を持つ)を生成
X = rand(1, 77) * randi([2,77]);
Y = rand(1, 77) * randi([2,77]);
% --------------------------------------

% --------------------------------------
% 処理部分

% 共分散
coeff_mat = corrcoef(X,Y);
coeff = coeff_mat(1,2);

% 傾き
slope = coeff/var(X);
% 切片
intercept = mean(Y) - slope*(mean(X));

disp('解答');
disp('傾き');
disp(slope);
disp('切片');
disp(intercept);
% --------------------------------------

% --------------------------------------
% 検算用
disp(polyfit(X,Y,1));
% --------------------------------------